src/cf/Enums/GDS_ТипыЗаправочныхВедомостей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>GDS_ТипыЗаправочныхВедомостей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Приходная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заправочная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Переливная</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Инвентаризационная</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/Номенклатура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Номенклатура</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ) Код производителя</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВесовойКоэффициентВхождения</Name>
					<Comment>(Упр) Весовой коэффициент вхождения</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаХраненияОстатков</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ЕдиницыИзмерения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>(Общ) Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоменклатурнаяГруппа</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НоменклатурныеГруппы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерГТД</Name>
					<Comment>(Регл) Номер ГТД по умолчанию</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.НомераГТД</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойПоставщик</Name>
					<Comment>(Упр)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Comment>(Общ) Ставка НДС по умолчанию для оформления документов</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтранаПроисхождения</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.СтраныМира</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УслугаРегл</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидУпаковкиОсновной</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатКоличествоВОсновнойУпаковке</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидУпаковкиДляРоссыпи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыУпаковки_уэ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатКоличествоВУпаковкеДляРоссыпи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>уатВидГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыГрузов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Производитель</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьЭтикетокДляКаждойЕдиницыНоменклатуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПечатьУПДиСФсПустымКоличеством</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МодельСпецодеждыИлиИнструмента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатМоделиСпецодеждыИИнструментов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>GDS_КодНСИ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодЕТСНГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыЕТСНГ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГНГ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатКодыГНГ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/уатМаршруты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатМаршруты</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВремяВПути</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерМаршрута</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеМаршрутаОднимПунктом</Name>
					<Comment>Ложь-пары пунктов, Истина-один пункт</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расстояние</Name>
					<Comment>Расстояние</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьДляПланированияВАРМЛогиста</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УсловиеРаботы</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатУсловияРаботы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатСтатусыДействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяОтправления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветНаКарте</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НочнойМаршрут</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Этапы</Name>
					<Comment>Этапы движения по маршруту</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВремяВПути</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктОтправления</Name>
							<Comment>Пункт отправления</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктПрибытия</Name>
							<Comment>Пункт прибытия</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Расстояние</Name>
							<Comment>Расстояние</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипТочкиМаршрута</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатТипыТочекМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УИД</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТранспортныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ТС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатТС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/GDS_ЗаполнениеВедомостиПоРаспознаванию/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Заполнение документа GDS_ЗаправочнаяВедомость по данным распознавания (VLM / OCR).
// Универсальный доступ к полям схемы { value, status, confidence } и заполнение ТЧ.
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Заполняет реквизиты документа и табличную часть Заправки по данным распознавания.
//
// Параметры:
//  ДокументОбъект - ДокументОбъект.GDS_ЗаправочнаяВедомость
//  Данные - Структура - каноническая схема (header, rows, footer, templateType)
//  СвязиСтрок - Массив из Неопределено - при передаче массива пополняется связями СтрокаVLM ↔ СтрокаТЧ
//
Процедура ЗаполнитьДокументПоДаннымРаспознавания(ДокументОбъект, Данные, СвязиСтрок = Неопределено) Экспорт
	
	ЗаполнитьШапкуДокумента(ДокументОбъект, Данные);
	ЗаполнитьДатуДокумента(ДокументОбъект, Данные);
	ЗаполнитьИтогДокумента(ДокументОбъект, Данные);
	ЗаполнитьСтрокиДокумента(ДокументОбъект, Данные, СвязиСтрок);
	
КонецПроцедуры

// Возвращает строку ТЧ по номеру строки бланка или добавляет новую.
//
Функция НайтиИлиДобавитьСтрокуЗаправки(ДокументОбъект, НомерСтрокиБланка) Экспорт
	
	Если НомерСтрокиБланка > 0 И НомерСтрокиБланка <= ДокументОбъект.Заправки.Количество() Тогда
		Возврат ДокументОбъект.Заправки[НомерСтрокиБланка - 1];
	КонецЕсли;
	
	Возврат ДокументОбъект.Заправки.Добавить();
	
КонецФункции

// Ищет ТС по гаражному или государственному номеру.
//
Функция НайтиТСПоРеквизиту(ИмяРеквизита, Значение) Экспорт
	
	Если ИмяРеквизита <> "ГаражныйНомер" И ИмяРеквизита <> "ГосударственныйНомер" Тогда
		Возврат Справочники.уатТС.ПустаяСсылка();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = СтрШаблон(
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	уатТС.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.уатТС КАК уатТС
		|ГДЕ
		|	уатТС.%1 = &Значение
		|	И НЕ уатТС.ПометкаУдаления",
		ИмяРеквизита);
	Запрос.УстановитьПараметр("Значение", Значение);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Справочники.уатТС.ПустаяСсылка();
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Ссылка;
	
КонецФункции

// Нормализует плотность: значения > 10 считаются в г/л и делятся на 1000.
//
Функция НормализоватьПлотность(Значение) Экспорт
	
	Если Значение <= 0 Тогда
		Возврат 0;
	КонецЕсли;
	
	Если Значение > 10 Тогда
		Возврат Значение / 1000;
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

// Собирает дату и время заправки из полей строки row_date и time.
//
Функция ДатаВремяЗаправкиИзПолейСтроки(ПоляСтроки, ДатаВедомости) Экспорт
	
	ТекстДаты = СтрокаПоляРаспознавания(ПоляСтроки, "row_date");
	ТекстВремени = СтрокаПоляРаспознавания(ПоляСтроки, "time");
	
	Возврат ДатаВремяЗаправкиИзТекстов(ТекстДаты, ТекстВремени, ДатаВедомости);
	
КонецФункции

// Собирает дату и время заправки из текстов колонок (для VLM-обёрток с алиасами ключей).
//
Функция ДатаВремяЗаправкиИзТекстов(ТекстДаты, ТекстВремени, ДатаВедомости) Экспорт
	
	Если Не ЗначениеЗаполнено(ТекстДаты) И Не ЗначениеЗаполнено(ТекстВремени) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	ДатаБезВремени = РазобратьДатуКолонкиСтрокиВедомости(ТекстДаты, ДатаВедомости);
	Если ДатаБезВремени = '00010101' И ЗначениеЗаполнено(ДатаВедомости) Тогда
		ДатаБезВремени = НачалоДня(ДатаВедомости);
	ИначеЕсли ДатаБезВремени = '00010101' Тогда
		Возврат '00010101';
	КонецЕсли;
	
	ВремяСтроки = РазобратьВремяКолонкиСтрокиВедомости(ТекстВремени);
	Если ВремяСтроки.Успех Тогда
		Возврат Дата(Год(ДатаБезВремени), Месяц(ДатаБезВремени), День(ДатаБезВремени), ВремяСтроки.Час, ВремяСтроки.Минута, 0);
	КонецЕсли;
	
	Возврат ДатаБезВремени;
	
КонецФункции

// Возвращает имя типа шаблона: zapravka | prihodnaya | perelivnaya.
//
Функция ИмяТипаШаблона(Данные, ТипВедомости) Экспорт
	
	Если ТипЗнч(Данные) = Тип("Структура")
		И Данные.Свойство("templateType")
		И ЗначениеЗаполнено(Данные.templateType) Тогда
		Возврат НРег(СокрЛП(Данные.templateType));
	КонецЕсли;
	
	Возврат ИмяТипаВедомостиПоПеречислению(ТипВедомости);
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Возвращает значение поля распознавания из коллекции полей секции.
//
// Параметры:
//  КоллекцияПолей - Структура
//  ИмяПоля - Строка - каноническое имя поля
//  ИмяКлюча - Строка - ключ в структуре (для VLM с алиасами); пустая строка — прямой поиск по ИмяПоля
//
Функция ЗначениеПоляРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча = "") Экспорт
	
	Поле = ПолеРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча);
	Если Поле = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат ЗначениеОбъектаПоляРаспознавания(Поле);
	
КонецФункции

// Возвращает строковое представление значения поля.
//
Функция СтрокаПоляРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча = "") Экспорт
	
	Если Не ПолеРаспознаванияДопустимоКЗаписи(КоллекцияПолей, ИмяПоля, ИмяКлюча) Тогда
		Возврат "";
	КонецЕсли;
	
	Значение = ЗначениеПоляРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча);
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат "";
	КонецЕсли;
	
	Возврат СокрЛП(Строка(Значение));
	
КонецФункции

// Возвращает числовое значение поля или 0.
//
Функция ЧислоПоляРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча = "") Экспорт
	
	Если Не ПолеРаспознаванияДопустимоКЗаписи(КоллекцияПолей, ИмяПоля, ИмяКлюча) Тогда
		Возврат 0;
	КонецЕсли;
	
	Значение = ЗначениеПоляРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча);
	Если ТипЗнч(Значение) = Тип("Число") Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Значение) Тогда
		Возврат 0;
	КонецЕсли;
	
	ТекстЗначения = СокрЛП(СтрЗаменить(Строка(Значение), ",", "."));
	Попытка
		Возврат Число(ТекстЗначения);
	Исключение
		Возврат 0;
	КонецПопытки;
	
КонецФункции

// Проверяет, допустимо ли значение поля для записи в документ.
//
Функция ПолеРаспознаванияДопустимоКЗаписи(КоллекцияПолей, ИмяПоля, ИмяКлюча = "") Экспорт
	
	Поле = ПолеРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча);
	Если Поле = Неопределено Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(Поле) <> Тип("Структура") Или Не Поле.Свойство("status") Тогда
		Возврат ЗначениеЗаполнено(ЗначениеОбъектаПоляРаспознавания(Поле));
	КонецЕсли;
	
	Возврат Поле.status = "ok" Или Поле.status = "partial";
	
КонецФункции

// Извлекает value / valueString из объекта поля распознавания.
//
Функция ЗначениеОбъектаПоляРаспознавания(Поле) Экспорт
	
	Если ТипЗнч(Поле) <> Тип("Структура") Тогда
		Возврат Поле;
	КонецЕсли;
	
	Значение = Неопределено;
	Если Поле.Свойство("value", Значение) И ЗначениеЗаполнено(Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Если Поле.Свойство("valueString", Значение) Тогда
		Возврат Значение;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьШапкуДокумента(ДокументОбъект, Данные)
	
	Если ТипЗнч(Данные) <> Тип("Структура") Или Не Данные.Свойство("header") Тогда
		Возврат;
	КонецЕсли;
	
	Шапка = Данные.header;
	Если ТипЗнч(Шапка) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	НомерВедомости = СтрокаПоляРаспознавания(Шапка, "statement_number");
	Если ЗначениеЗаполнено(НомерВедомости) И Не ЗначениеЗаполнено(ДокументОбъект.НомерВходящий) Тогда
		ДокументОбъект.НомерВходящий = Лев(НомерВедомости, 15);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ГСМ) Тогда
		НаименованиеГСМ = СтрокаПоляРаспознавания(Шапка, "fuel_name");
		Если ЗначениеЗаполнено(НаименованиеГСМ) Тогда
			ГСМ = Справочники.Номенклатура.НайтиПоНаименованию(НаименованиеГСМ, Истина);
			Если ЗначениеЗаполнено(ГСМ) Тогда
				ДокументОбъект.ГСМ = ГСМ;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДокументОбъект.ПУ) Тогда
		ИменаПолейЛокации = Новый Массив;
		ИменаПолейЛокации.Добавить("field_name");
		ИменаПолейЛокации.Добавить("production_unit");
		Для Каждого ИмяПоля Из ИменаПолейЛокации Цикл
			НаименованиеЛокации = СтрокаПоляРаспознавания(Шапка, ИмяПоля);
			Если Не ЗначениеЗаполнено(НаименованиеЛокации) Тогда
				Продолжить;
			КонецЕсли;
			Локация = Справочники.уатМаршруты.НайтиПоНаименованию(НаименованиеЛокации, Истина);
			Если ЗначениеЗаполнено(Локация) Тогда
				ДокументОбъект.ПУ = Локация;
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуДокумента(ДокументОбъект, Данные)
	
	Если ТипЗнч(Данные) <> Тип("Структура") Или Не Данные.Свойство("header") Тогда
		Возврат;
	КонецЕсли;
	
	Шапка = Данные.header;
	Если ТипЗнч(Шапка) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	День = ЧислоПоляРаспознавания(Шапка, "date_day");
	Месяц = ЧислоПоляРаспознавания(Шапка, "date_month");
	Если День = 0 Или Месяц = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Год = ЧислоПоляРаспознавания(Шапка, "date_year");
	Если Год < 2000 Тогда
		Год = Год(ДокументОбъект.Дата);
	КонецЕсли;
	Если Год < 2000 Тогда
		Год = Год(ТекущаяДатаСеанса());
	КонецЕсли;
	
	Попытка
		ДокументОбъект.Дата = Дата(Год, Месяц, День);
	Исключение
		// Некорректная дата на бланке — оставляем текущую дату документа.
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаполнитьИтогДокумента(ДокументОбъект, Данные)
	
	Если ТипЗнч(Данные) <> Тип("Структура") Или Не Данные.Свойство("footer") Тогда
		Возврат;
	КонецЕсли;
	
	Подвал = Данные.footer;
	Если ТипЗнч(Подвал) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Итого = ЧислоПоляРаспознавания(Подвал, "total_liters");
	Если Итого > 0 И (Не ЗначениеЗаполнено(ДокументОбъект.КоличествоВсего) Или ДокументОбъект.КоличествоВсего = 0) Тогда
		ДокументОбъект.КоличествоВсего = Итого;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокиДокумента(ДокументОбъект, Данные, СвязиСтрок = Неопределено)
	
	Если ТипЗнч(Данные) <> Тип("Структура") Или Не Данные.Свойство("rows") Тогда
		Возврат;
	КонецЕсли;
	
	СтрокиДанных = Данные.rows;
	Если ТипЗнч(СтрокиДанных) <> Тип("Массив") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТипа = ИмяТипаШаблона(Данные, ДокументОбъект.ТипВедомости);
	СуммаЛитров = 0;
	
	Для Каждого СтрокаДанных Из СтрокиДанных Цикл
		
		Если ТипЗнч(СтрокаДанных) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		НомерСтрокиБланка = 0;
		Если СтрокаДанных.Свойство("rowIndex") Тогда
			НомерСтрокиБланка = СтрокаДанных.rowIndex;
		КонецЕсли;
		
		ПоляСтроки = Неопределено;
		Если СтрокаДанных.Свойство("fields") Тогда
			ПоляСтроки = СтрокаДанных.fields;
		КонецЕсли;
		
		Если ТипЗнч(ПоляСтроки) <> Тип("Структура") Тогда
			Продолжить;
		КонецЕсли;
		
		СтрокаТЧ = НайтиИлиДобавитьСтрокуЗаправки(ДокументОбъект, НомерСтрокиБланка);
		
		Если ИмяТипа = "prihodnaya" Тогда
			ЗаполнитьСтрокуПриходной(СтрокаТЧ, ПоляСтроки, ДокументОбъект.Дата);
		ИначеЕсли ИмяТипа = "perelivnaya" Тогда
			ЗаполнитьСтрокуПереливной(СтрокаТЧ, ПоляСтроки, ДокументОбъект.Дата);
		Иначе
			ЗаполнитьСтрокуЗаправочной(СтрокаТЧ, ПоляСтроки, ДокументОбъект.Дата);
		КонецЕсли;
		
		Если СвязиСтрок <> Неопределено Тогда
			Связь = Новый Структура("СтрокаVLM, СтрокаТЧ", СтрокаДанных, СтрокаТЧ);
			СвязиСтрок.Добавить(Связь);
		КонецЕсли;
		
		СуммаЛитров = СуммаЛитров + ЧислоПоляРаспознавания(ПоляСтроки, "quantity_liters");
		
	КонецЦикла;
	
	Если (Не ЗначениеЗаполнено(ДокументОбъект.КоличествоВсего) Или ДокументОбъект.КоличествоВсего = 0)
		И СуммаЛитров > 0 Тогда
		ДокументОбъект.КоличествоВсего = СуммаЛитров;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуЗаправочной(СтрокаТЧ, ПоляСтроки, ДатаВедомости)
	
	ЗаполнитьКоличествоСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьПлотностьСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьНомерПЛСтроки(СтрокаТЧ, ПоляСтроки, "waybill_number");
	ЗаполнитьДатуЗаправкиСтроки(СтрокаТЧ, ПоляСтроки, ДатаВедомости);
	ПодобратьТСДляСтроки(СтрокаТЧ, ПоляСтроки, "garage_number", "vehicle_plate");
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПриходной(СтрокаТЧ, ПоляСтроки, ДатаВедомости)
	
	ЗаполнитьКоличествоСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьПлотностьСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьДатуЗаправкиСтроки(СтрокаТЧ, ПоляСтроки, ДатаВедомости);
	ПодобратьТСДляСтроки(СтрокаТЧ, ПоляСтроки, "vehicle_or_org", "");
	
КонецПроцедуры

Процедура ЗаполнитьСтрокуПереливной(СтрокаТЧ, ПоляСтроки, ДатаВедомости)
	
	ЗаполнитьКоличествоСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьПлотностьСтроки(СтрокаТЧ, ПоляСтроки);
	ЗаполнитьДатуЗаправкиСтроки(СтрокаТЧ, ПоляСтроки, ДатаВедомости);
	ПодобратьТСДляСтроки(СтрокаТЧ, ПоляСтроки, "vehicle_or_org", "receiver_plate");
	
КонецПроцедуры

Процедура ЗаполнитьКоличествоСтроки(СтрокаТЧ, ПоляСтроки)
	
	КоличествоЛитров = ЧислоПоляРаспознавания(ПоляСтроки, "quantity_liters");
	Если КоличествоЛитров > 0
		И (Не ЗначениеЗаполнено(СтрокаТЧ.Количество) Или СтрокаТЧ.Количество = 0) Тогда
		СтрокаТЧ.Количество = КоличествоЛитров;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьПлотностьСтроки(СтрокаТЧ, ПоляСтроки)
	
	Плотность = НормализоватьПлотность(ЧислоПоляРаспознавания(ПоляСтроки, "density"));
	Если Плотность > 0
		И (Не ЗначениеЗаполнено(СтрокаТЧ.Плотность) Или СтрокаТЧ.Плотность = 0) Тогда
		СтрокаТЧ.Плотность = Плотность;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьНомерПЛСтроки(СтрокаТЧ, ПоляСтроки, ИмяПоля)
	
	НомерПЛ = СтрокаПоляРаспознавания(ПоляСтроки, ИмяПоля);
	Если ЗначениеЗаполнено(НомерПЛ) И Не ЗначениеЗаполнено(СтрокаТЧ.НомерПЛ) Тогда
		СтрокаТЧ.НомерПЛ = НомерПЛ;
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьДатуЗаправкиСтроки(СтрокаТЧ, ПоляСтроки, ДатаВедомости)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ДатаЗаправки) Тогда
		Возврат;
	КонецЕсли;
	
	ДатаВремяЗаправки = ДатаВремяЗаправкиИзПолейСтроки(ПоляСтроки, ДатаВедомости);
	Если ДатаВремяЗаправки <> '00010101' Тогда
		СтрокаТЧ.ДатаЗаправки = ДатаВремяЗаправки;
	КонецЕсли;
	
КонецПроцедуры

// Дата колонки строки: 1–2 цифры — день; одна точка — день.месяц; две точки — день.месяц.год.
//
Функция РазобратьДатуКолонкиСтрокиВедомости(ТекстДаты, ДатаВедомости)
	
	ТекстДаты = СокрЛП(ТекстДаты);
	Если Не ЗначениеЗаполнено(ТекстДаты) Тогда
		Возврат '00010101';
	КонецЕсли;
	
	ПозицияПробела = Найти(ТекстДаты, " ");
	Если ПозицияПробела > 0 Тогда
		ТекстДаты = Лев(ТекстДаты, ПозицияПробела - 1);
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ДатаВедомости) Тогда
		ДатаВедомости = ТекущаяДатаСеанса();
	КонецЕсли;
	
	ГодВедомости = Год(ДатаВедомости);
	МесяцВедомости = Месяц(ДатаВедомости);
	
	Части = СтрРазделить(ТекстДаты, ".");
	
	Попытка
		Если Части.Количество() = 1 Тогда
			День = Число(Части[0]);
			Возврат Дата(ГодВедомости, МесяцВедомости, День);
		ИначеЕсли Части.Количество() = 2 Тогда
			День = Число(Части[0]);
			Месяц = Число(Части[1]);
			Возврат Дата(ГодВедомости, Месяц, День);
		ИначеЕсли Части.Количество() >= 3 Тогда
			День = Число(Части[0]);
			Месяц = Число(Части[1]);
			Год = Число(Части[2]);
			Если Год < 100 Тогда
				Год = Цел(ГодВедомости / 100) * 100 + Год;
			КонецЕсли;
			Если Год < 2000 Тогда
				Год = ГодВедомости;
			КонецЕсли;
			Возврат Дата(Год, Месяц, День);
		КонецЕсли;
	Исключение
		Возврат '00010101';
	КонецПопытки;
	
	Возврат '00010101';
	
КонецФункции

// Время колонки строки: часы и минуты (форматы 12:58, 1:58, 12:58:30).
//
Функция РазобратьВремяКолонкиСтрокиВедомости(ТекстВремени)
	
	Результат = Новый Структура("Успех, Час, Минута", Ложь, 0, 0);
	
	ТекстВремени = СокрЛП(СтрЗаменить(ТекстВремени, ",", ":"));
	Если Не ЗначениеЗаполнено(ТекстВремени) Тогда
		Возврат Результат;
	КонецЕсли;
	
	ПозицияПробела = Найти(ТекстВремени, " ");
	Если ПозицияПробела > 0 Тогда
		ТекстВремени = Сред(ТекстВремени, ПозицияПробела + 1);
	КонецЕсли;
	
	Части = СтрРазделить(ТекстВремени, ":");
	Если Части.Количество() < 2 Тогда
		Возврат Результат;
	КонецЕсли;
	
	Попытка
		Результат.Час = Число(Части[0]);
		Результат.Минута = Число(Части[1]);
		Результат.Успех = Истина;
	Исключение
		Возврат Результат;
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Процедура ПодобратьТСДляСтроки(СтрокаТЧ, ПоляСтроки, ИмяПоляГаражныйНомер, ИмяПоляГосНомер)
	
	Если ЗначениеЗаполнено(СтрокаТЧ.ТС) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяПоляГаражныйНомер) Тогда
		ГаражныйНомер = СтрокаПоляРаспознавания(ПоляСтроки, ИмяПоляГаражныйНомер);
		Если ЗначениеЗаполнено(ГаражныйНомер) Тогда
			ТС = НайтиТСПоРеквизиту("ГаражныйНомер", ГаражныйНомер);
			Если Не ЗначениеЗаполнено(ТС) Тогда
				ТС = НайтиТСПоРеквизиту("ГосударственныйНомер", ГаражныйНомер);
			КонецЕсли;
			Если ЗначениеЗаполнено(ТС) Тогда
				СтрокаТЧ.ТС = ТС;
				Возврат;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИмяПоляГосНомер) Тогда
		ГосНомер = СтрокаПоляРаспознавания(ПоляСтроки, ИмяПоляГосНомер);
		Если ЗначениеЗаполнено(ГосНомер) Тогда
			ТС = НайтиТСПоРеквизиту("ГосударственныйНомер", ГосНомер);
			Если ЗначениеЗаполнено(ТС) Тогда
				СтрокаТЧ.ТС = ТС;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Функция ПолеРаспознавания(КоллекцияПолей, ИмяПоля, ИмяКлюча = "")
	
	Если ТипЗнч(КоллекцияПолей) <> Тип("Структура") Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(ИмяКлюча) Тогда
		ИмяКлюча = ИмяПоля;
	КонецЕсли;
	
	Поле = Неопределено;
	Если КоллекцияПолей.Свойство(ИмяКлюча, Поле) Тогда
		Возврат Поле;
	КонецЕсли;
	
	Если ИмяКлюча <> ИмяПоля И КоллекцияПолей.Свойство(ИмяПоля, Поле) Тогда
		Возврат Поле;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ИмяТипаВедомостиПоПеречислению(ТипВедомости)
	
	Если ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Заправочная Тогда
		Возврат "zapravka";
	ИначеЕсли ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Приходная Тогда
		Возврат "prihodnaya";
	ИначеЕсли ТипВедомости = Перечисления.GDS_ТипыЗаправочныхВедомостей.Переливная Тогда
		Возврат "perelivnaya";
	КонецЕсли;
	
	Возврат "zapravka";
	
КонецФункции

#КонецОбласти
